project/src/DataProcessors/ВыгрузкаСтруктурыФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаСтруктурыФормата</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДляВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

project/src/Catalogs/ОбъектыФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ОбъектыФормата</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВерсииФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаОбщихСвойств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбщегоРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбщихРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереносОписанийВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/СвойстваФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СвойстваФормата</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписаниеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектХранительСвойств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбщегоСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбщихРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НижняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фасеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ТипыФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ТипыФормата</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВерсииФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазовыйТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИмен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВключатьВОписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменБазовогоТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фасеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/DataProcessors/ВыгрузкаСтруктурыФормата/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Выполняет выгрузку структуры формата в файл.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при выгрузке.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения выгрузки.
Процедура ВыполнитьВыгрузку(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
	
	мЗаписьXML = Новый ЗаписьXML;
	мЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	ОбщиеПеременные.Вставить("ФлагОшибки", Ложь);
	Попытка
		ВыгрузитьСтруктуруФормата(мЗаписьXML, ОбщиеПеременные);
	Исключение
		ОбщиеПеременные.ФлагОшибки = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка при выгрузке структуры формата в файл'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	мЗаписьXML.Закрыть();
	мЗаписьXML = Неопределено;
	Результат = Новый Структура("ФлагОшибки", ОбщиеПеременные.ФлагОшибки);
	
	Если Не ОбщиеПеременные.ФлагОшибки Тогда
		Результат.Вставить("РезультатВыгрузки", Новый ДвоичныеДанные(ИмяВременногоФайла));
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ИмяВременногоФайла = "";
	КонецПопытки;
	ПоместитьВоВременноеХранилище(Результат, АдресВременногоХранилища);

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ВыгрузитьСтруктуруФормата(мЗаписьXML, ОбщиеПеременные)
	ПространствоИменВерсииФормата = ОбщиеПеременные.ВерсияФормата.ПространствоИмен;
	ПространствоИменВспомогательногоПакета = "http://www.1c.ru/SSL/Exchange/Message";
	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:schema");
	УстановитьАтрибут(мЗаписьXML, "xmlns:ns1", ПространствоИменВспомогательногоПакета);
	УстановитьАтрибут(мЗаписьXML, "xmlns:tns", ПространствоИменВерсииФормата);
	УстановитьАтрибут(мЗаписьXML, "xmlns:xs", "http://www.w3.org/2001/XMLSchema");
	УстановитьАтрибут(мЗаписьXML, "targetNamespace", ПространствоИменВерсииФормата);
	УстановитьАтрибут(мЗаписьXML, "attributeFormDefault", "unqualified");
	УстановитьАтрибут(мЗаписьXML, "elementFormDefault", "qualified");

	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:import");
	УстановитьАтрибут(мЗаписьXML, "namespace", ПространствоИменВспомогательногоПакета);
	мЗаписьXML.ЗаписатьКонецЭлемента();
	// Запрос сводный объекты формата.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбъектыФормата.Наименование КАК НаименованиеОбъекта,
	|	ОбъектыФормата.ЭтоГруппаОбщихСвойств,
	|	ОбъектыФормата.ТипОбщегоРеквизита,
	|	ОбъектыФормата.Ссылка КАК ОбъектФорматаСсылка
	|ИЗ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|ГДЕ ОбъектыФормата.Владелец = &ВерсияФормата
	|УПОРЯДОЧИТЬ ПО ОбъектыФормата.Наименование";
	Запрос.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
	
	// Объекты формата + свойства формата.
	ТекстЗапросаСвойства = "ВЫБРАТЬ
	|	СвойстваФормата.Ссылка КАК СвойствоСсылка,
	|	СвойстваФормата.Наименование КАК НаименованиеСвойства,
	|	СвойстваФормата.Тип КАК ТипСвойства,
	|	СвойстваФормата.ЭтоГруппа КАК ЭтоГруппаСвойств,
	|	СвойстваФормата.Обязательное КАК Обязательное,
	|	СвойстваФормата.НижняяГраница КАК НижняяГраница,
	|	СвойстваФормата.СоставнойТип КАК СоставнойТип,
	|	СвойстваФормата.Родитель КАК Родитель,
	|	СвойствоОбъектФормата.Ссылка,
	|	СвойствоТипФормата.Ссылка,
	|	ВЫБОР КОГДА СвойствоОбъектФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ТипСсылочный,
	|	ВЫБОР КОГДА СвойствоТипФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ТипИзФормата,
	|	МножественныйТипСвойства.ТипФормата КАК ТипФормата,
	|	МножественныйТипСвойства.ИмяТипа КАК ТипФорматаИмя,
	|	ВЫБОР КОГДА МножественныйТипФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК МножественныйТипИзФормата,
	|	ВЫБОР КОГДА МножественныйОбъектФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК МножественныйТипСсылочный
	|ИЗ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата КАК СвойстваФормата
	|ПО СвойстваФормата.Владелец = ОбъектыФормата.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата.Состав КАК МножественныйТипСвойства
	|ПО СвойстваФормата.Ссылка = МножественныйТипСвойства.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК СвойствоОбъектФормата
	|ПО СвойствоОбъектФормата.Наименование = ВЫРАЗИТЬ(СвойстваФормата.Тип КАК Строка(100))
	|	И СвойствоОбъектФормата.Владелец = &ВерсияФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата КАК СвойствоТипФормата
	|ПО СвойствоТипФормата.Наименование = ВЫРАЗИТЬ(СвойстваФормата.Тип КАК Строка(100))
	|	И СвойствоТипФормата.Владелец = &ВерсияФормата
	|	И СвойствоТипФормата.ПометкаУдаления = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата КАК МножественныйТипФормата
	|ПО МножественныйТипФормата.Наименование = ВЫРАЗИТЬ(МножественныйТипСвойства.ТипФормата КАК Строка(100))
	|	И МножественныйТипФормата.Владелец = &ВерсияФормата
	|	И МножественныйТипФормата.ПометкаУдаления = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК МножественныйОбъектФормата
	|ПО МножественныйОбъектФормата.Наименование = ВЫРАЗИТЬ(МножественныйТипСвойства.ТипФормата КАК Строка(100))
	|	И МножественныйОбъектФормата.Владелец = &ВерсияФормата
	|ГДЕ ОбъектыФормата.Владелец = &ВерсияФормата И ОбъектыФормата.Ссылка = &ОбъектФормата
	|УПОРЯДОЧИТЬ ПО СвойстваФормата.Порядок
	|ИТОГИ Максимум(ВЫБОР КОГДА СвойствоОбъектФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ),
	|	Максимум(ВЫБОР КОГДА СвойствоТипФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ)
	|ПО СвойстваФормата.Ссылка
	|";
	
	// Объекты формата + значения формата.
	ТекстЗапросаЗначения = "ВЫБРАТЬ
	|	ЗначенияФормата.Наименование КАК НаименованиеЗначения
	|ИЗ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияФормата КАК ЗначенияФормата
	|ПО ЗначенияФормата.Владелец = ОбъектыФормата.Ссылка
	|ГДЕ ОбъектыФормата.Владелец = &ВерсияФормата И ОбъектыФормата.Ссылка = &ОбъектФормата
	|УПОРЯДОЧИТЬ ПО ЗначенияФормата.Порядок
	|";

	ВыборкаОбъект = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОбъект.Следующий() Цикл
		// Проверка на наличие свойств.
		ЗапросСвойства = Новый Запрос;
		ЗапросСвойства.Текст = ТекстЗапросаСвойства;
		ЗапросСвойства.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
		ЗапросСвойства.УстановитьПараметр("ОбъектФормата", ВыборкаОбъект.ОбъектФорматаСсылка);
		РезультатЗапросаСвойства = ЗапросСвойства.Выполнить();
		Если НЕ РезультатЗапросаСвойства.Пустой() Тогда
			ОбработатьЗапросПоСвойствамОбъекта(ОбщиеПеременные, РезультатЗапросаСвойства, ВыборкаОбъект, мЗаписьXML);
			Продолжить;
		КонецЕсли;
		ЗапросЗначения = Новый Запрос;
		ЗапросЗначения.Текст = ТекстЗапросаЗначения;
		ЗапросЗначения.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
		ЗапросЗначения.УстановитьПараметр("ОбъектФормата", ВыборкаОбъект.ОбъектФорматаСсылка);
		РезультатЗапросаЗначения = ЗапросЗначения.Выполнить();
		Если НЕ РезультатЗапросаЗначения.Пустой() Тогда
			ОбработатьЗапросПоЗначениямОбъекта(РезультатЗапросаЗначения, ВыборкаОбъект, мЗаписьXML);
		КонецЕсли; 		
	КонецЦикла;
	// Типы формата, не дублированные в значениях формата.

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТипыФормата.Наименование КАК НаименованиеОбъекта,
	|	ТипыФормата.БазовыйТип,
	|	ТипыФормата.СоставнойТип,
	|	ТипыФорматаСостав.ТипФормата КАК ТипФорматаСостав,
	|	ТипыФорматаСостав.ИмяТипа КАК ТипФорматаИмя,
	|	ВЫБОР КОГДА СоставОбъектФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ТипСсылочный,
	|	ВЫБОР КОГДА СоставТипФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ТипИзФормата,
	|	ТипыФорматаФасеты.ВидФасета КАК ВидФасета,
	|	ТипыФорматаФасеты.ЗначениеФасета КАК ЗначениеФасета
	|ИЗ Справочник.ТипыФормата КАК ТипыФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата.Состав КАК ТипыФорматаСостав
	|ПО ТипыФормата.Ссылка = ТипыФорматаСостав.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата.Фасеты КАК ТипыФорматаФасеты
	|ПО ТипыФормата.Ссылка = ТипыФорматаФасеты.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|ПО ТипыФормата.Наименование = ОбъектыФормата.Наименование
	|	И ОбъектыФормата.Владелец = &ВерсияФормата  	
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК СоставОбъектФормата
	|ПО СоставОбъектФормата.Наименование = ВЫРАЗИТЬ(ТипыФорматаСостав.ТипФормата КАК Строка(100))
	|	И СоставОбъектФормата.Владелец = &ВерсияФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата КАК СоставТипФормата
	|ПО СоставТипФормата.Наименование = ВЫРАЗИТЬ(ТипыФорматаСостав.ТипФормата КАК Строка(100))
	|	И СоставТипФормата.Владелец = &ВерсияФормата
	|	И СоставТипФормата.ПометкаУдаления = ЛОЖЬ 	
	|ГДЕ ТипыФормата.Владелец = &ВерсияФормата И ОбъектыФормата.Ссылка IS NULL И ТипыФормата.ПометкаУдаления = ЛОЖЬ
	|ИТОГИ ПО ТипыФормата.Ссылка";
	Запрос.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
	ВыборкаОбъект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъект.Следующий() Цикл
		Если ВыборкаОбъект.СоставнойТип Тогда
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:complexType");
			УстановитьАтрибут(мЗаписьXML, "name", СокрЛП(ВыборкаОбъект.НаименованиеОбъекта));
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:choice");
		Иначе
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:simpleType");
			УстановитьАтрибут(мЗаписьXML, "name", СокрЛП(ВыборкаОбъект.НаименованиеОбъекта));
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:restriction");
			Если СокрЛП(ВыборкаОбъект.БазовыйТип) = "Ref" Тогда
				УстановитьАтрибут(мЗаписьXML, "base", "ns1:" + СокрЛП(ВыборкаОбъект.БазовыйТип));
				мЗаписьXML.ЗаписатьКонецЭлемента(); 
				мЗаписьXML.ЗаписатьКонецЭлемента(); 
				Продолжить;
			Иначе
				ПредставлениеТипа = НРег(СокрЛП(ВыборкаОбъект.БазовыйТип));
				Тип = ""; Длина = Неопределено; Точность = Неопределено;
				МинимальнаяДлинаСтроки = Неопределено; НеограниченнаяДлина = Неопределено;
				КонвертацияДанныхXDTOСервер.РазложитьПредставлениеПростогоТипа(ПредставлениеТипа, Истина, Тип, Длина, Точность, МинимальнаяДлинаСтроки, НеограниченнаяДлина);
				УстановитьАтрибут(мЗаписьXML, "base", "xs:" + Тип);
			КонецЕсли;
		КонецЕсли;

		Выборка = ВыборкаОбъект.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ВыборкаОбъект.СоставнойТип Тогда
				ПрефиксТипа = "";
				НаименованиеТипа = "";
				Если ЗначениеЗаполнено(Выборка.ТипФорматаСостав) Тогда
					ТипСвойства = СокрЛП(Выборка.ТипФорматаСостав);
					НаименованиеТипаЗадано = Ложь;
					Если ЗначениеЗаполнено(Выборка.ТипФорматаИмя) Тогда
						НаименованиеТипа = СокрЛП(Выборка.ТипФорматаИмя);
						НаименованиеТипаЗадано = Истина;
					Иначе
						НаименованиеТипа = ТипСвойства;
					КонецЕсли;

					Если Выборка.ТипСсылочный Или Выборка.ТипИзФормата Тогда
						ПрефиксТипа = "tns:";
						Если Выборка.ТипСсылочный И НЕ НаименованиеТипаЗадано Тогда
							НаименованиеТипа = СтрЗаменить(НаименованиеТипа, "КлючевыеСвойства", "") + "Ссылка";
						КонецЕсли;
					Иначе
						ПрефиксТипа = "xs:";
						Если НЕ НаименованиеТипаЗадано Тогда
							// Наименование типа получаем в русской трактовке.
							Длина = Неопределено; 
							Точность= Неопределено; 
							МинДлина= Неопределено; 
							НеограниченнаяДлина = Неопределено;
							КонвертацияДанныхXDTOСервер.РазложитьПредставлениеПростогоТипа(ТипСвойства,Ложь, НаименованиеТипа, Длина, 
								Точность, МинДлина, НеограниченнаяДлина);
						КонецЕсли;
					КонецЕсли;
					мЗаписьXML.ЗаписатьНачалоЭлемента("xs:element");
					УстановитьАтрибут(мЗаписьXML, "name", НаименованиеТипа);
					УстановитьАтрибут(мЗаписьXML, "type", ПрефиксТипа + ТипСвойства);
					// При множественном типе каждый сам по себе не обязательный.
					УстановитьАтрибут(мЗаписьXML, "minOccurs", "0");
					мЗаписьXML.ЗаписатьКонецЭлемента();//xs:element
				КонецЕсли;
			Иначе
				// Фасеты
				Если ЗначениеЗаполнено(Выборка.ВидФасета) И ЗначениеЗаполнено(Выборка.ЗначениеФасета) Тогда
					ИмяФасета = ПреобразоватьВидФасета(СокрЛП(Выборка.ВидФасета));
					мЗаписьXML.ЗаписатьНачалоЭлемента("xs:" + ИмяФасета);
					УстановитьАтрибут(мЗаписьXML, "value", СокрЛП(Выборка.ЗначениеФасета));
					мЗаписьXML.ЗаписатьКонецЭлемента();//xs:фасет
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:restriction / xs:choice 
		мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:simpleType / complexType

	КонецЦикла;
	мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:schema
КонецПроцедуры

Функция ПреобразоватьВидФасета(ВидФасета)
	Если ВидФасета = "Образец" Тогда
		ИмяФасета = "pattern";
	ИначеЕсли ВидФасета = "ПробельныеСимволы" Тогда
		ИмяФасета = "whiteSpace";
	ИначеЕсли ВидФасета = "Длина" Тогда
		ИмяФасета = "Length";
	ИначеЕсли ВидФасета = "МаксВключающее" Тогда
		ИмяФасета = "maxInclusive";
	ИначеЕсли ВидФасета = "МинВключающее" Тогда
		ИмяФасета = "minInclusive";
	ИначеЕсли ВидФасета = "МаксДлина" Тогда
		ИмяФасета = "maxLength";
	ИначеЕсли ВидФасета = "МинДлина" Тогда
		ИмяФасета = "minLength";
	ИначеЕсли ВидФасета = "МаксИсключающее" Тогда
		ИмяФасета = "minExclusive";
	ИначеЕсли ВидФасета = "МинИсключающее" Тогда
		ИмяФасета = "maxExclusive";
	ИначеЕсли ВидФасета = "РазрядовДробнойЧасти" Тогда
		ИмяФасета = "fractionDigits";
	ИначеЕсли ВидФасета = "РазрядовВсего" Тогда
		ИмяФасета = "totalDigits";
	Иначе
		ИмяФасета = ВидФасета;
	КонецЕсли;
	Возврат ИмяФасета;
КонецФункции


Процедура ОбработатьЗапросПоСвойствамОбъекта(ОбщиеПеременные, РезультатЗапросаСвойства, ВыборкаОбъект, мЗаписьXML)
	
	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:complexType");
	УстановитьАтрибут(мЗаписьXML, "name", СокрЛП(ВыборкаОбъект.НаименованиеОбъекта));
	Если ВыборкаОбъект.ТипОбщегоРеквизита = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть Тогда
		ТЧОбязательна = Ложь;
		Если ТипЗнч(ВыборкаОбъект) = Тип("Структура") Тогда
			ТЧОбязательна = ВыборкаОбъект.ТЧОбязательна;
		КонецЕсли;
		ДополнитьТекстДляТЧ(мЗаписьXML, ВыборкаОбъект.НаименованиеОбъекта, ТЧОбязательна);
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаОбъект.ТипОбщегоРеквизита) Тогда
		мЗаписьXML.ЗаписатьНачалоЭлемента("xs:complexContent");
		мЗаписьXML.ЗаписатьНачалоЭлемента("xs:extension");
		УстановитьАтрибут(мЗаписьXML, "base", "ns1:Object");
	КонецЕсли;
	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:sequence");
	ВыборкаСвойства = РезультатЗапросаСвойства.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ТЧОбъекта = Новый Соответствие;
	Пока ВыборкаСвойства.Следующий() Цикл
		Если ВыборкаСвойства.НаименованиеСвойства = "AdditionalInfo" Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаСвойства.Родитель)
			И ТипЗнч(ВыборкаОбъект) <> Тип("Структура") Тогда
			Продолжить;
		ИначеЕсли НЕ ВыборкаСвойства.ЭтоГруппаСвойств И ВыборкаСвойства.СоставнойТип Тогда
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:element");
			ЗаполнитьАтрибутыСвойстваОбъекта(мЗаписьXML, ВыборкаСвойства, СокрЛП(ВыборкаСвойства.НаименованиеСвойства));

			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:complexType");
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:choice");

			ВыборкаТипы = ВыборкаСвойства.Выбрать();
			Пока ВыборкаТипы.Следующий() Цикл
				ТипСвойства = СокрЛП(ВыборкаТипы.ТипФормата);
				НаименованиеТипаЗадано = Ложь;
				Если ЗначениеЗаполнено(ВыборкаТипы.ТипФорматаИмя) Тогда
					НаименованиеТипа = СокрЛП(ВыборкаТипы.ТипФорматаИмя);
					НаименованиеТипаЗадано = Истина;
				Иначе
					НаименованиеТипа = ТипСвойства;
				КонецЕсли;
				Если ВыборкаТипы.МножественныйТипИзФормата Или ВыборкаТипы.МножественныйТипСсылочный Тогда
					Если ВыборкаТипы.МножественныйТипСсылочный И НЕ НаименованиеТипаЗадано Тогда
						Если СтрНайти(НаименованиеТипа, "Ссылка") = 0 Тогда
							НаименованиеТипа = СтрЗаменить(НаименованиеТипа, "КлючевыеСвойства", "") + "Ссылка";
						КонецЕсли;
						НаименованиеТипа = СтрЗаменить(НаименованиеТипа, ".", "_");
					КонецЕсли;
					ТипСвойства = "tns:" + ТипСвойства;
				Иначе
					Если НЕ НаименованиеТипаЗадано Тогда
						// Наименование типа получаем в русской трактовке.
						Длина = Неопределено; 
						Точность = Неопределено; 
						МинДлина = Неопределено; 
						НеограниченнаяДлина = Неопределено;
						КонвертацияДанныхXDTOСервер.РазложитьПредставлениеПростогоТипа(ТипСвойства,Ложь, НаименованиеТипа, Длина, Точность, МинДлина, НеограниченнаяДлина);
					КонецЕсли;
					ТипСвойства = "xs:" + ТипСвойства;
				КонецЕсли;
				мЗаписьXML.ЗаписатьНачалоЭлемента("xs:element");
				УстановитьАтрибут(мЗаписьXML, "name", НаименованиеТипа);
				УстановитьАтрибут(мЗаписьXML, "type", ТипСвойства);
				// При множественном типе нижняя граница всегда 0.
				УстановитьАтрибут(мЗаписьXML, "minOccurs", "0");
				мЗаписьXML.ЗаписатьКонецЭлемента();  // xs:element
			КонецЦикла;
			мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:choice
			мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:complexType
			мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:element
		ИначеЕсли ВыборкаСвойства.ТипСсылочный
				Или ВыборкаСвойства.ТипИзФормата
				Или ВыборкаСвойства.ЭтоГруппаСвойств Тогда
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:element");
			// Бывает что простой тип ошибочно прописывается в типы.
			ПрефиксТипа = "tns:";
			ЗаполнитьАтрибутыСвойстваОбъекта(мЗаписьXML, ВыборкаСвойства, СокрЛП(ВыборкаСвойства.НаименованиеСвойства), ПрефиксТипа + СокрЛП(ВыборкаСвойства.ТипСвойства));
			мЗаписьXML.ЗаписатьКонецЭлемента();  // xs:element
			Если ВыборкаСвойства.ЭтоГруппаСвойств И НЕ ВыборкаСвойства.ТипСсылочный Тогда
				ТЧОбъекта.Вставить(СокрЛП(ВыборкаСвойства.НаименованиеСвойства), ВыборкаСвойства.СвойствоСсылка);
			КонецЕсли;
		Иначе
			мЗаписьXML.ЗаписатьНачалоЭлемента("xs:element");
			УстановитьАтрибут(мЗаписьXML, "name", СокрЛП(ВыборкаСвойства.НаименованиеСвойства));
			ТипПростогоТипа = "";
			ПредставлениеТипа = НРег(СокрЛП(ВыборкаСвойства.ТипСвойства));
			Длина = Неопределено; Точность = Неопределено;
			МинимальнаяДлинаСтроки = Неопределено; НеограниченнаяДлина = Неопределено;
			КонвертацияДанныхXDTOСервер.РазложитьПредставлениеПростогоТипа(ПредставлениеТипа, Истина, ТипПростогоТипа, Длина, Точность, МинимальнаяДлинаСтроки, НеограниченнаяДлина);
			
			ТабФасеты = ВыборкаСвойства.СвойствоСсылка.Фасеты;
			Если ТабФасеты.Количество() > 0 Тогда
				ПервыйПроход = Истина;
				Для Каждого СтрФасет Из ТабФасеты Цикл
					ИмяФасета = ПреобразоватьВидФасета(СокрЛП(СтрФасет.ВидФасета));
					Если ИмяФасета = "whiteSpace" И СтрФасет.ЗначениеФасета = "preserve"
						И ТабФасеты.Количество() = 1 Тогда
						// Если только один такой фасет то пропускаем.
						// Если к нему прилагаются другие фасеты то учитываем.
						Продолжить;
					КонецЕсли;
					Если ПервыйПроход Тогда
						ЗаполнитьАтрибутыСвойстваОбъекта(мЗаписьXML, ВыборкаСвойства);
						мЗаписьXML.ЗаписатьНачалоЭлемента("xs:simpleType");
						мЗаписьXML.ЗаписатьНачалоЭлемента("xs:restriction");
						УстановитьАтрибут(мЗаписьXML, "base", "xs:" + СокрЛП(ТипПростогоТипа));
						ПервыйПроход = Ложь;
					КонецЕсли;
					мЗаписьXML.ЗаписатьНачалоЭлемента("xs:" + ИмяФасета);
					УстановитьАтрибут(мЗаписьXML, "value", СокрЛП(СтрФасет.ЗначениеФасета));
					мЗаписьXML.ЗаписатьКонецЭлемента();  // xs:Фасет
				КонецЦикла;
				Если ПервыйПроход Тогда
					// Не записан ни один фасет
					ЗаполнитьАтрибутыСвойстваОбъекта(мЗаписьXML, ВыборкаСвойства,, "xs:" + СокрЛП(ТипПростогоТипа));
				Иначе
					мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:simpleType
					мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:restriction
				КонецЕсли;
			Иначе
				// Возможно есть предопределенные значения
				ЗапросЗначения = Новый Запрос;
				ЗапросЗначения.Текст = "ВЫБРАТЬ
				|	Наименование
				|ИЗ Справочник.ЗначенияФормата
				|ГДЕ Владелец = &Свойство И НЕ ПометкаУдаления
				|УПОРЯДОЧИТЬ ПО Порядок, Наименование";
				ЗапросЗначения.УстановитьПараметр("Свойство", ВыборкаСвойства.СвойствоСсылка);
				РезультатЗначения = ЗапросЗначения.Выполнить();
				Если НЕ РезультатЗначения.Пустой() Тогда
					ЗаполнитьАтрибутыСвойстваОбъекта(мЗаписьXML, ВыборкаСвойства);

					мЗаписьXML.ЗаписатьНачалоЭлемента("xs:simpleType");
					мЗаписьXML.ЗаписатьНачалоЭлемента("xs:restriction");
					УстановитьАтрибут(мЗаписьXML, "base", "xs:" + СокрЛП(ТипПростогоТипа));
					ВыборкаЗначения = РезультатЗначения.Выбрать();
					Пока ВыборкаЗначения.Следующий() Цикл
						мЗаписьXML.ЗаписатьНачалоЭлемента("xs:enumeration");
						УстановитьАтрибут(мЗаписьXML, "value", СокрЛП(ВыборкаЗначения.Наименование));
						мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:enumeration
					КонецЦикла;
					мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:restriction
					мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:simpleType
				Иначе
					ЗаполнитьАтрибутыСвойстваОбъекта(мЗаписьXML, ВыборкаСвойства,, "xs:" + СокрЛП(ТипПростогоТипа));
				КонецЕсли;
			КонецЕсли;	
			мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:element
		КонецЕсли;
	КонецЦикла;
	Если ВыборкаОбъект.НаименованиеОбъекта = "Info" Тогда
		мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:sequence
	Иначе
		СтрАтрибут = "<xs:any namespace=""##any"" processContents=""lax"" minOccurs=""0"" maxOccurs=""unbounded""/>";
		мЗаписьXML.ЗаписатьБезОбработки(Символы.ПС + СтрАтрибут);
		мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:sequence
		СтрАтрибут = "<xs:anyAttribute namespace=""##any"" processContents=""lax""/>";
		мЗаписьXML.ЗаписатьБезОбработки(Символы.ПС + СтрАтрибут);
		Если НЕ ЗначениеЗаполнено(ВыборкаОбъект.ТипОбщегоРеквизита) Тогда
			мЗаписьXML.ЗаписатьКонецЭлемента(); // <xs:extension base=""ns1:Object"">
			мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:complexContent
		КонецЕсли;
	КонецЕсли;
	мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:complexType
	Если ТЧОбъекта.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	// Табличные части объекта как отдельные объекты.
	ТекстЗапросаСвойства = "ВЫБРАТЬ
	|	СвойстваФормата.Наименование КАК НаименованиеСвойства,
	|	СвойстваФормата.Ссылка КАК СвойствоСсылка,
	|	СвойстваФормата.Тип КАК ТипСвойства,
	|	СвойстваФормата.ЭтоГруппа КАК ЭтоГруппаСвойств,
	|	СвойстваФормата.Обязательное КАК Обязательное,
	|	СвойстваФормата.НижняяГраница КАК НижняяГраница,
	|	СвойстваФормата.СоставнойТип КАК СоставнойТип,
	|	СвойстваФормата.Родитель КАК Родитель,
	|	СвойствоОбъектФормата.Ссылка,
	|	СвойствоТипФормата.Ссылка,
	|	ВЫБОР КОГДА СвойствоОбъектФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ТипСсылочный,
	|	ВЫБОР КОГДА СвойствоТипФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ТипИзФормата,
	|	МножественныйТипСвойства.ТипФормата КАК ТипФормата,
	|	МножественныйТипСвойства.ИмяТипа КАК ТипФорматаИмя,
	|	ВЫБОР КОГДА МножественныйТипФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК МножественныйТипИзФормата,
	|	ВЫБОР КОГДА МножественныйОбъектФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК МножественныйТипСсылочный
	|ИЗ Справочник.СвойстваФормата КАК СвойстваФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата.Состав КАК МножественныйТипСвойства
	|ПО СвойстваФормата.Ссылка = МножественныйТипСвойства.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК СвойствоОбъектФормата
	|ПО СвойствоОбъектФормата.Наименование = ВЫРАЗИТЬ(СвойстваФормата.Тип КАК Строка(100))
	|	И СвойствоОбъектФормата.Владелец = &ВерсияФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата КАК СвойствоТипФормата
	|ПО СвойствоТипФормата.Наименование = ВЫРАЗИТЬ(СвойстваФормата.Тип КАК Строка(100))
	|	И СвойствоТипФормата.Владелец = &ВерсияФормата
	|	И СвойствоТипФормата.ПометкаУдаления = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыФормата КАК МножественныйТипФормата
	|ПО МножественныйТипФормата.Наименование = ВЫРАЗИТЬ(МножественныйТипСвойства.ТипФормата КАК Строка(100))
	|	И МножественныйТипФормата.Владелец = &ВерсияФормата
	|	И МножественныйТипФормата.ПометкаУдаления = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК МножественныйОбъектФормата
	|ПО МножественныйОбъектФормата.Наименование = ВЫРАЗИТЬ(МножественныйТипСвойства.ТипФормата КАК Строка(100))
	|	И МножественныйОбъектФормата.Владелец = &ВерсияФормата
	|ГДЕ СвойстваФормата.Родитель = &СвойствоФормата
	|УПОРЯДОЧИТЬ ПО СвойстваФормата.Порядок
	|ИТОГИ Максимум(ВЫБОР КОГДА СвойствоОбъектФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ),
	|	Максимум(ВЫБОР КОГДА СвойствоТипФормата.Ссылка IS NULL ТОГДА
	|		ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ)
	|ПО СвойстваФормата.Ссылка
	|";
	Для Каждого ЭлементТЧ Из ТЧОбъекта Цикл
		ИмяТЧ = ЭлементТЧ.Ключ;
		ТЧСсылка = ЭлементТЧ.Значение;
		ДанныеТЧ = Новый Структура("ЭтоГруппаОбщихСвойств, ТипОбщегоРеквизита, ЭтоТЧОбъекта", 
			Ложь, Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть, Истина);
		ДанныеТЧ.Вставить("ТЧОбязательна", ТЧСсылка.Обязательное);
		ДанныеТЧ.Вставить("НаименованиеОбъекта", СокрЛП(ВыборкаОбъект.НаименованиеОбъекта) + "." + ТЧСсылка.Наименование);
		ЗапросРеквизитыТЧ = Новый Запрос;
		ЗапросРеквизитыТЧ.Текст = ТекстЗапросаСвойства;
		ЗапросРеквизитыТЧ.УстановитьПараметр("ВерсияФормата", ОбщиеПеременные.ВерсияФормата);
		ЗапросРеквизитыТЧ.УстановитьПараметр("СвойствоФормата", ТЧСсылка);
		РезультатЗапросаСвойстваТЧ = ЗапросРеквизитыТЧ.Выполнить();
		Если НЕ РезультатЗапросаСвойстваТЧ.Пустой() Тогда
			ОбработатьЗапросПоСвойствамОбъекта(ОбщиеПеременные, РезультатЗапросаСвойстваТЧ, ДанныеТЧ, мЗаписьXML);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьЗапросПоЗначениямОбъекта(РезультатЗапросаЗначения, ВыборкаОбъект, мЗаписьXML)
	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:simpleType");
	УстановитьАтрибут(мЗаписьXML, "name", СокрЛП(ВыборкаОбъект.НаименованиеОбъекта));
	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:restriction");
	УстановитьАтрибут(мЗаписьXML, "base", "xs:string");
	
	Выборка = РезультатЗапросаЗначения.Выбрать();
	Пока Выборка.Следующий() Цикл
		мЗаписьXML.ЗаписатьНачалоЭлемента("xs:enumeration");
		УстановитьАтрибут(мЗаписьXML, "value", СокрЛП(Выборка.НаименованиеЗначения));
		мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:enumeration
	КонецЦикла;
	мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:restriction
	мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:simpleType
КонецПроцедуры

Процедура ДополнитьТекстДляТЧ(мЗаписьXML, ИмяТЧ, ТЧОбязательна)
	ШаблонРеквизитТЧ = "<xs:element name=""Строка"" type=""tns:%ИмяТЧ%.Строка"" maxOccurs=""unbounded""/>";
	СтрАтрибут = СтрЗаменить(ШаблонРеквизитТЧ, "%ИмяТЧ%", ИмяТЧ);
	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:sequence");
	мЗаписьXML.ЗаписатьБезОбработки(Символы.ПС + СтрАтрибут);
	мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:sequence
	мЗаписьXML.ЗаписатьКонецЭлемента(); // xs:complexType
	мЗаписьXML.ЗаписатьНачалоЭлемента("xs:complexType");
	УстановитьАтрибут(мЗаписьXML, "name", ИмяТЧ + ".Строка"); 
КонецПроцедуры

// Устанавливает атрибут xml-узла
//
// Параметры: 
//  Имя            - имя атрибута
//  Значение       - устанавливаемое значение
//
Процедура УстановитьАтрибут(мЗаписьXML, Имя, Значение)

	Если Значение = Null Тогда
		СтрокаЗаписи = "";
	Иначе
		СтрокаЗаписи = XMLСтрока(Значение);
	КонецЕсли;
	
	мЗаписьXML.ЗаписатьАтрибут(Имя, СтрокаЗаписи);
	
КонецПроцедуры

Процедура ЗаполнитьАтрибутыСвойстваОбъекта(мЗаписьXML, ВыборкаСвойства, ИмяСтрокой = "", ТипСтрокой = "")
	Если ИмяСтрокой <> "" Тогда
		УстановитьАтрибут(мЗаписьXML, "name", ИмяСтрокой);
	КонецЕсли;
	Если ТипСтрокой <> "" Тогда
		УстановитьАтрибут(мЗаписьXML, "type", ТипСтрокой);
	КонецЕсли;
	Если НЕ ВыборкаСвойства.Обязательное Тогда
		УстановитьАтрибут(мЗаписьXML, "nillable", Истина);
	КонецЕсли; 
	Если ВыборкаСвойства.НижняяГраница <> 1 Тогда
		УстановитьАтрибут(мЗаписьXML, "minOccurs", СокрЛП(ВыборкаСвойства.НижняяГраница));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
